import pandas as pd

In [1]:
import pandas as pd

In [2]:
#####Series

In [10]:
s=pd.Series([23,4,5,78,90])

In [11]:
s

0    23
1     4
2     5
3    78
4    90
dtype: int64

In [12]:
s[4]=99

In [13]:
s

0    23
1     4
2     5
3    78
4    99
dtype: int64

In [15]:
type(s)

pandas.core.series.Series

In [16]:
s.dtype

dtype('int64')

In [17]:
s.shape

(5,)

In [18]:
s.size

5

In [19]:
s.values

array([23,  4,  5, 78, 99], dtype=int64)

In [20]:
##### Data frame

In [21]:
r=pd.Series([2,3,4,7,8])
n=pd.Series(['nitin','ranjay','pooja','sima'])
m=pd.Series([25,67,90,45,56,78,90,23,56,89])

In [22]:
df=pd.DataFrame({
    'roll':r,
    'name':n,
    'markes':m
})

In [23]:
df

   roll    name  markes
0   2.0   nitin      25
1   3.0  ranjay      67
2   4.0   pooja      90
3   7.0    sima      45
4   8.0     NaN      56
5   NaN     NaN      78
6   NaN     NaN      90
7   NaN     NaN      23
8   NaN     NaN      56
9   NaN     NaN      89

In [24]:
df.dtypes

roll      float64
name       object
markes      int64
dtype: object

In [25]:
df.shape

(10, 3)

In [26]:
df.size

30

In [27]:
##### Load the data

In [30]:
df=pd.read_csv('student.csv')

In [31]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [32]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df1=pd.read_csv('student1.csv')

In [36]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [37]:
df1=pd.read_csv('student1.csv',names=['a','b','c','d','e'])

In [38]:
df1

    a        b   c      d   e
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [39]:
None

In [43]:
df2=pd.read_csv('student1.csv',names=None)

In [44]:
df2

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [45]:
df2=pd.read_csv('student1.csv',header=None)

In [46]:
df2

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [47]:
df3=pd.read_csv('student3.tsv')

In [48]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [51]:
df4=pd.read_csv('student3.tsv',sep='\t')

In [52]:
df4

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [56]:
df4=pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')

In [57]:
df4

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

##### Access

In [58]:
df4.shape

(150, 5)

In [63]:
df.dtypes

1          int64
anil      object
TE        object
56.77    float64
22         int64
dtype: object

In [64]:
df.columns

Index(['1', 'anil', 'TE', '56.77', '22'], dtype='object')

In [65]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [66]:
df.values

array([[2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [67]:
df.T

           0       1        2      3       4      5      6      7      8
1          2       3        4      5       6      7      8      9     10
anil    amit  aniket  ajinkya   asha  ayesha   amar  amita   amol  anmol
TE        TE      BE       TE     TE      BE     BE     BE     TE     BE
56.77  59.77   76.88    69.66  63.28   49.55  65.34  68.33  56.75  78.66
22        21      19       20     20      20     19     23     20     21

In [68]:
df.head()

   1     anil  TE  56.77  22
0  2     amit  TE  59.77  21
1  3   aniket  BE  76.88  19
2  4  ajinkya  TE  69.66  20
3  5     asha  TE  63.28  20
4  6   ayesha  BE  49.55  20

In [69]:
df.head(3)

   1     anil  TE  56.77  22
0  2     amit  TE  59.77  21
1  3   aniket  BE  76.88  19
2  4  ajinkya  TE  69.66  20

In [70]:
df.tail()

    1    anil  TE  56.77  22
4   6  ayesha  BE  49.55  20
5   7    amar  BE  65.34  19
6   8   amita  BE  68.33  23
7   9    amol  TE  56.75  20
8  10   anmol  BE  78.66  21

In [71]:
df.tail(10)

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

##### index based slicing

In [74]:
x=df.iloc[2:8,1:4]

In [75]:
x

      anil  TE  56.77
2  ajinkya  TE  69.66
3     asha  TE  63.28
4   ayesha  BE  49.55
5     amar  BE  65.34
6    amita  BE  68.33
7     amol  TE  56.75

In [76]:
x=df.iloc[2:,1:4]

In [77]:
x

      anil  TE  56.77
2  ajinkya  TE  69.66
3     asha  TE  63.28
4   ayesha  BE  49.55
5     amar  BE  65.34
6    amita  BE  68.33
7     amol  TE  56.75
8    anmol  BE  78.66

In [78]:
x=df.iloc[2:,1:]

In [79]:
x

      anil  TE  56.77  22
2  ajinkya  TE  69.66  20
3     asha  TE  63.28  20
4   ayesha  BE  49.55  20
5     amar  BE  65.34  19
6    amita  BE  68.33  23
7     amol  TE  56.75  20
8    anmol  BE  78.66  21

In [83]:
x=df.iloc[[2,4,7,8],:]

In [84]:
x

    1     anil  TE  56.77  22
2   4  ajinkya  TE  69.66  20
4   6   ayesha  BE  49.55  20
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [85]:
x=df.iloc[4,:]

In [86]:
x

1             6
anil     ayesha
TE           BE
56.77     49.55
22           20
Name: 4, dtype: object

In [87]:
x=df.iloc[:,1]

In [88]:
x

0       amit
1     aniket
2    ajinkya
3       asha
4     ayesha
5       amar
6      amita
7       amol
8      anmol
Name: anil, dtype: object

In [89]:
x=df.iloc[3,1]

In [90]:
x

'asha'

##### level based slliceing

In [94]:
df.loc[:,'anil']

0       amit
1     aniket
2    ajinkya
3       asha
4     ayesha
5       amar
6      amita
7       amol
8      anmol
Name: anil, dtype: object

In [96]:
df.loc[:,['anil','56.77']]

      anil  56.77
0     amit  59.77
1   aniket  76.88
2  ajinkya  69.66
3     asha  63.28
4   ayesha  49.55
5     amar  65.34
6    amita  68.33
7     amol  56.75
8    anmol  78.66

In [98]:
df['anil']

0       amit
1     aniket
2    ajinkya
3       asha
4     ayesha
5       amar
6      amita
7       amol
8      anmol
Name: anil, dtype: object

In [99]:
df.anil

0       amit
1     aniket
2    ajinkya
3       asha
4     ayesha
5       amar
6      amita
7       amol
8      anmol
Name: anil, dtype: object

In [100]:
df.anil.values

array(['amit', 'aniket', 'ajinkya', 'asha', 'ayesha', 'amar', 'amita',
       'amol', 'anmol'], dtype=object)

In [101]:
df.drop(5)

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [102]:
df.drop([2,7,4,5])

    1    anil  TE  56.77  22
0   2    amit  TE  59.77  21
1   3  aniket  BE  76.88  19
3   5    asha  TE  63.28  20
6   8   amita  BE  68.33  23
8  10   anmol  BE  78.66  21

In [105]:
df.drop('anil',axis=1)

    1  TE  56.77  22
0   2  TE  59.77  21
1   3  BE  76.88  19
2   4  TE  69.66  20
3   5  TE  63.28  20
4   6  BE  49.55  20
5   7  BE  65.34  19
6   8  BE  68.33  23
7   9  TE  56.75  20
8  10  BE  78.66  21

In [106]:
df.drop(['anil','22'],axis=1)

    1  TE  56.77
0   2  TE  59.77
1   3  BE  76.88
2   4  TE  69.66
3   5  TE  63.28
4   6  BE  49.55
5   7  BE  65.34
6   8  BE  68.33
7   9  TE  56.75
8  10  BE  78.66

In [107]:
df['56.77'].min()

49.55

In [108]:
df=pd.read_csv('student.csv')

In [109]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [111]:
df['marks'].max()

78.66

In [112]:
df['marks'].sum()

644.9899999999999

In [113]:
df['marks'].std()

9.207178901994535

In [114]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [117]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [118]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [120]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [121]:
df.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [122]:
df.sum(axis=1,numeric_only=True)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [124]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [125]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [127]:
df.sort_values('class')

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [130]:
df.sort_values(['class','marks'])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20

##### custom column operation

In [131]:
df['marks']+0.5

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [132]:
df['marks']= df['marks']+0.5

In [133]:
df

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
5     6   ayesha    BE  50.05   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   23
8     9     amol    TE  57.25   20
9    10    anmol    BE  79.16   21

In [134]:
df['cgpa']=df['marks']/10+0.034

In [135]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.27   22  5.761
1     2     amit    TE  60.27   21  6.061
2     3   aniket    BE  77.38   19  7.772
3     4  ajinkya    TE  70.16   20  7.050
4     5     asha    TE  63.78   20  6.412
5     6   ayesha    BE  50.05   20  5.039
6     7     amar    BE  65.84   19  6.618
7     8    amita    BE  68.83   23  6.917
8     9     amol    TE  57.25   20  5.759
9    10    anmol    BE  79.16   21  7.950

In [138]:
df['first_class']=df['marks']>60

In [139]:
df

   roll     name class  marks  age   cgpa  first_class
0     1     anil    TE  57.27   22  5.761        False
1     2     amit    TE  60.27   21  6.061         True
2     3   aniket    BE  77.38   19  7.772         True
3     4  ajinkya    TE  70.16   20  7.050         True
4     5     asha    TE  63.78   20  6.412         True
5     6   ayesha    BE  50.05   20  5.039        False
6     7     amar    BE  65.84   19  6.618         True
7     8    amita    BE  68.83   23  6.917         True
8     9     amol    TE  57.25   20  5.759        False
9    10    anmol    BE  79.16   21  7.950         True

In [144]:
x=['m','m','f','f','m','f','f','m','f','m']

In [145]:
df['gender']=x
df

   roll     name class  marks  age   cgpa  first_class gender
0     1     anil    TE  57.27   22  5.761        False      m
1     2     amit    TE  60.27   21  6.061         True      m
2     3   aniket    BE  77.38   19  7.772         True      f
3     4  ajinkya    TE  70.16   20  7.050         True      f
4     5     asha    TE  63.78   20  6.412         True      m
5     6   ayesha    BE  50.05   20  5.039        False      f
6     7     amar    BE  65.84   19  6.618         True      f
7     8    amita    BE  68.83   23  6.917         True      m
8     9     amol    TE  57.25   20  5.759        False      f
9    10    anmol    BE  79.16   21  7.950         True      m

In [148]:
ndf=pd.DataFrame({
    'roll':range(1,11),
    'cgpa':df['marks']/10+0.034,
    'gender':['m','m','f','f','m','f','f','m','f','m']
})

ndf

   roll   cgpa gender
0     1  5.761      m
1     2  6.061      m
2     3  7.772      f
3     4  7.050      f
4     5  6.412      m
5     6  5.039      f
6     7  6.618      f
7     8  6.917      m
8     9  5.759      f
9    10  7.950      m

In [150]:
df=pd.read_csv('student.csv')

In [152]:
df.join

<bound method DataFrame.join of    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21>

In [153]:
df.merge

<bound method DataFrame.merge of    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21>

In [157]:
df.merge(ndf,on='roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  5.761      m
1     2     amit    TE  59.77   21  6.061      m
2     3   aniket    BE  76.88   19  7.772      f
3     4  ajinkya    TE  69.66   20  7.050      f
4     5     asha    TE  63.28   20  6.412      m
5     6   ayesha    BE  49.55   20  5.039      f
6     7     amar    BE  65.34   19  6.618      f
7     8    amita    BE  68.33   23  6.917      m
8     9     amol    TE  56.75   20  5.759      f
9    10    anmol    BE  78.66   21  7.950      m

In [158]:
df.join(ndf)

ValueError: columns overlap but no suffix specified: Index(['roll'], dtype='object')

In [163]:
df5=pd.read_csv('student5.csv')

In [164]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [165]:

pd.concat([df,df5])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [168]:
pd.concat([df,df5],ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

##### string operation

In [169]:
name='sima'

In [170]:
name

'sima'

In [174]:
name.upper()

'SIMA'

In [175]:
name.lower()

'sima'

In [177]:
name.replace('i','oo')

'sooma'

In [178]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [179]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [181]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [182]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [183]:
df['name'].str.count('a')

0    1
1    1
2    1
3    2
4    2
5    2
6    2
7    2
8    1
9    1
Name: name, dtype: int64

In [185]:
df['name'].str.find('i')

0    2
1    2
2    2
3    2
4   -1
5   -1
6   -1
7    2
8   -1
9   -1
Name: name, dtype: int64

In [186]:
df['name'].str.isalpha()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

##### grouping and alligation

In [187]:
gr=df.groupby('class')

In [189]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

gr.get_group('TE')

In [190]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [191]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [192]:
gr.sum()

       roll                        name   marks  age
class
BE       34  aniketayeshaamaramitaanmol  338.76  102
TE       21     anilamitajinkyaashaamol  306.23  103

In [193]:
gr['marks'].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

##### boolean filter

In [197]:
df['marks']>60   #boolean filter

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [196]:
mask=df['marks']>60
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

df[df['marks']>60]

In [200]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [205]:
x=df[(df['marks']>60)&(df['class']=='BE')]
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

##### Export the data

In [209]:
x.to_csv('output.csv',index=False)
x.to_html('outpout.html',index=False)